# которая находит строку, содержащую символ 'a', за которым следуют два или три символа 'b'.
import re

pattern = r'ab{2,3}'  # 'a' + 2 или 3 'b'

test_strings = ["ab", "abb", "abbb", "abbbb", "a", "ac"]

for s in test_strings:
    if re.fullmatch(pattern, s):
        print(f"Совпадение найдено: {s}")
    else:
        print(f"Нет совпадения: {s}")

#import re — подключаем модуль регулярных выражений.
# r'ab{2,3}' — шаблон:
#a — обязательно буква "a"
#b{2,3} — за ней 2 или 3 буквы "b"
#re.fullmatch() — проверяет, совпадает ли вся строка с шаблоном.
#Программа перебирает список строк и выводит, какие подходят.